{"podcast_details": {"podcast_title": "Motley Fool Money", "episode_title": "Stocks to Stay Cool", "episode_image": "https://ssl-static.libsyn.com/p/assets/5/5/6/e/556e311d4476c65be5bbc093207a2619/MotleyFoolMoney-3000x30001.png", "episode_transcript": " I love these companies that are like the slow steady growers that have a nice mid single digit sales growth with a double digit profit growth. Those are the ones that you know you're not relying on high sales growth to drive their business and their earnings. I'm Ricky Mulvey and that's Motley Fool senior analyst Sanmit Deo. Deidre Woolard caught up with him to look at the companies keeping us cool during a very hot summer. They discuss some of the less considered tailwinds for HVAC businesses, how long term investors can think about these companies, and the challenges and benefits of investing in a family run business. I'm really glad that you brought up this topic because it's important and it's also it's kind of fascinating. July was the hottest month ever recorded on Earth according to the World Meteorological Society. And I was looking at some stats about 90% of homes in the US now use air conditioning and two thirds of that is either central air or a heat pump. As you might guess, the Northeast is where we see less of that activity. But I think I feel like that's changing. What are you seeing in the air conditioning business? Because it seems like it's something that is evolving so quickly. Yeah, who knew a boring industry like this could actually be pretty fascinating once you dig into a little bit. And it's something that all of us need, heating, ventilation, cooling for our houses, for our cars, for other things. And there's a lot of innovation going on in the industry as well. So just to kind of take a step back, the HVAC industry in North America is very large, about 45 billion in 2021. You know, generates about 150 billion annual revenue and employs over one and a half million people in the United States. It's expected to grow about 4% from 2023 through 2028 over the next five years. So each year in the US, over three million heating and air conditioner systems are replaced and 14 billion is spent on HVAC services or HVAC repairs. So any of us that own a home know that once that AC unit breaks down, you're going to spend a lot of money to get it repaired. And you're probably going to spend a lot of money just to get it maintained so that you're not suffocating in the heat that we've had as of late from what you've said in terms of the hottest time. But not only is the HVAC industry doing these things, but you know, the US Department of Energy is investing heavily to improve in energy efficiency standards. So that's something that's also driving the industry getting more efficient in terms of heating and cooling, because so much of our the reason we're having such hot temperatures and climate change is because of heating and cooling, which consumes so much energy. So some of the major drivers in the industry are rising disposable incomes, increasing applications in smart homes, growing demands for heat pumps, which I didn't even know about heat pumps before I started looking into this more. I have a traditional AC unit in my home. So the way I kind of looked at this industry is there's the manufacturers and people, the companies that make the units, the products and services that help us keep the heating, ventilation and cooling. And then there's the distributors, which are the ones that get those products and services to contractors and do-it-yourselfers. So in the manufacturing space, it's a pretty concentrated market. The top 10 manufacturers comprise about 85 percent of the total market. Some of the big names are Trane, Lennox, Carrier, Reem, York, and then there's a bunch of others amongst those. Some of the challenges facing the industry are aging infrastructure, skilled labor shortage and rising energy costs. And the air conditioning market share by service. So it comprises about 50 percent of residentials, 30 percent commercial and 20 percent industrial. This is like as a percentage of total sales. Some of the interesting tech trends in HVAC, which you wouldn't think of innovation and technology in HVAC industry is indoor air quality. You know, we've with the if you've lived in the Northeast and you've had to deal with some of those smoggy conditions from the wildfires coming from Canada, or if you're on the West Coast where there's wildfire smog constantly, it's not even a new thing. Unfortunately, indoor air quality is very important, especially also having gone through the pandemic where we got very attuned to having clean quality air in our in our homes that kind of filters out pollution and viruses. And bacteria and things like that. So the indoor air quality industry is worth about nine point eight billion dollars now and is projected to grow to almost 12 million in 2027. And then also smart thermostats, which, you know, like you have your Google Nest and you have your other products that help regulate your temperature on a more efficient way. I've actually noticed I moved from an apartment to a home and in the apartment, a lot of the heating and cooling was was controlled by either a heating vent that we had in our in our in our apartment or like a central kind of system for the whole apartment building. But in our home, we have a smart thermostat and I've noticed that you can set it so that you your energy is efficiently distributed throughout the day. So if you're not in the home, you can have it kind of lower or use less. And the Google Nest is what I have does a pretty good job of that. So that industry is worth about one point two billion dollars is projected to grow to almost three point eight billion in 2029. I want to talk a little bit about Carrier because they're really interesting. So you've got this older recognizable name in air conditioning. You mentioned it's one of the biggies, but they're making some changes as a company. They're honing their focus. They talked about this on their earnings call. So a fair chunk of their business is refrigeration and fire safety. But they're kind of getting out of that. They're getting out of both the commercial refrigeration and security businesses. Those are going on the market in September. Residential fire is going. They're starting that a month after that. So they're planning to exit those businesses. It sounds like there may be turning into more of a pure play. I know they've also done some acquisitions, including these men climate solutions, which is a heat pump company. So is Carrier kind of shifting a little bit? Yeah, you know, Carrier is one a name I've heard before. It's I started digging into it as we as we discussed digging into this industry. It's about a forty five billion dollar company. You know, they're one of the big manufacturers of HVAC products operate through the HVAC. They have three segments HVAC refrigeration and fire and safety. Like you said, they're looking to divest the refrigeration and fire security segments to become a more of a pure play HVAC company, which also puts them aligned with more aligned with Train, which is the market share leader in HVAC manufacturers. Train actually, ironically, is about the same market cap of about forty five billion dollars. So they're trading almost in line. So Carrier has has the stock has come up as of as of late, but you know, they've grown their earnings at close to 20 percent over the on average over the past three years. And they're they're transforming their business into more of a pure play. And the projections are for, you know, pretty this isn't, you know, a home run high growth industry or a company, but their projections are for about five percent annual average sales growth after the acquisition and, you know, EPS growth over the next five years of about 10 percent. So it's a good quality company. The acquisition of Vietman Climate Solutions, I hope I said that right, you know, is going to be about 13 billion in cash that they're paying for this company. Vietman makes heat pumps, which is, you know, becoming a more popular trend in the HVAC industry. You know, sales of heat pumps grew by 11 percent in twenty twenty two, 40 percent in Europe. And interesting stat in the United States, heat pumps have overtaken gas furnace sales in twenty twenty two. So there's also financial incentives and subsidies that are driving heat pump growth because they are seen as a more energy efficient way of heating and cooling. And so that's an area that they're growing and adding to their business with that acquisition. So it's it's it's an interesting company. It's trading at fairly reasonable valuations for the next year. It's about 20 times P.E. four percent free cash flow yield. You know, for next year, they're looking at growing the revenue at 10 percent. They have an EPS about 12 percent. Their margins are almost in line with trains. Their carriers at about 16 and a half percent trains at a little about at about 18 percent. So they're very close. It'll be interesting to see how the acquisition kind of pushes carrier forward and how it competes with train. But very interesting company for sure. The heat pump thing is interesting to me because I hadn't really thought about it. But what's go to what you mentioned is one of the on the distribution side. They talked about that a lot as a growth area for the company, traditionally for them, smaller part of the business because they're so concentrated in the Sun Belt. But like you said, the move away from gas furnaces, it's it's carrier seeing it, too. So this ongoing electrification, that should be a positive thing for for the heat pump part of the business. Right. Yeah, absolutely. And another thing that I was going to mention about Carrier Global, too, is not only in the U.S. and we're focused, I've been focused a little bit more on the U.S. but even in the globally, you have countries like India with the growing middle class. I was reading about how with their growing middle class is expected to lift the number of ACs in that country to roughly five and a half billion by mid century from about two billion today. So, you know, India, China, internationally are going to be huge areas where they want to put in energy efficient systems. Let's talk a little bit about what's go. It's kind of a full favorite because I know like Bill Mann and some of our other friends that come on the podcast just love this business. And it's the tradition of this business kind of gets me. You've got this family business, the chairman, Albert Named, his son, AJ, the president of the company. He's the elder, but he's been the chairman and CEO since 1972. He he runs his earnings call like you're like you're just hanging out with him somewhere. It's it's it's a very homey earnings call. I really loved it. But how do you think about this business as that sort of older family business evolving into something else? Family business are interesting. They can be tricky because sometimes it can be pretty, pretty positive given that, you know, you have the founder and and owners that have been there for a long time. You know, this is their livelihood. This is what they've created from scratch. And they are very vested not only financially, but emotionally into the business and to see it thrive. You know that they have the best interests of the company at heart. But then sometimes in family businesses, you know, families argue families bicker. You could have disagreements within the family that could cause some some other issues that that that take away from the operations of the business that aren't business related. They're more squabbling and other other factors that have happened at other family businesses. So it really depends on kind of something that you have to keep an eye on for sure. Yeah. And with with what's go you mentioned earlier, the sort of like distribution side of the business is the much more fragmented end of things. So I noticed what's go they they're tending to do a lot more of that of gobbling up those those smaller organizations. I'm wondering if this this this end of the business feels a little to me like self storage in that you have these smaller, smaller companies that maybe will get gobbled up and we'll see more consolidation over time. Does does that seem like where it's headed as an industry? Yeah, you know, what's goes the market share leader in HVAC distribution and Ferguson is another company which we'll probably talk about later. They're number two, but it's very fragmented. There's a there's a what's go itself has has made about three small acquisitions in twenty twenty one and now they control about 13 percent of the 50 billion dollar market for distributed HVAC parts. So it is a distributed it is a fragmented industry and you could see what's go making more acquisitions to control more of the the market. Yeah, absolutely. So we've talked a little bit about you mentioned in the beginning. So we've got the commercial side, which we you know, we sort of experience as office buildings and the lovely coolness of a mall, things like that. We've got the residential side, which is all of us trying not to crank our AC this summer. But there's the also the other part that I find interesting is a growth area, which is industrial. And, you know, we tend to think of HVAC as just cooling the spaces where we are. But the other thing that I've been thinking about for a while is the cold chain, which is the idea of keeping things cold. We saw it during the pandemic because the vaccines needed to be kept at a certain temperature. And so there was a lot of focus on the cold chain. Then I'm invested in a couple of routes that do cold storage, AmeriCold and prologis. But things have to be kept cold kind of all along the journey. I know train. They've got thermoking. That's their cold transport business. That's about 15 percent of their revenue carrier. They have transit cold. I feel like this is going to be a bigger part of the sort of the HVAC story going forward. What do you think? Yeah, absolutely. You know, as you have these. Bigger, faster, hotter technologies that need to be cooled like computers and all the growing data centers that are powering, you know, the AI networks and technology companies that we're hearing about so much. All that technology causes a lot of heat and that heat needs to be cooled. So it's definitely an area that would be, I think, a bigger part of their businesses. Yeah, because you've got two things. You've got cold transport, which is like keeping food, medicines, things like that cold as we go along. And then the other part of it, you just mentioned at the data centers, data centers are more and more in the news lately because they take a lot of water because they have to be cooled a lot. And on the most recent earnings call, train, they went really into this about the growth of data centers and AI, because like you said, AI chips that use more power, that means more heat. So it's this really it's this big challenge for data centers, especially because data centers are also they're sometimes like in the middle of nowhere. And these small towns are dealing with this thing that comes in and uses a lot of water, which is a whole other issue. But I know Train is working with their customers on some of those solutions. They're looking at like this emerging cooling technology, something called liquid stack, which sounded really cool. How do we know pun intended again? But how do we kind of separate the data center section of the business out from the rest of it? Because it seems like like that's a really interesting area. But it also given what we know about the core industry, it's probably not a big part yet, right? Yeah, you know, it's always fun to hear about AI and almost when when we were talking about doing the segment and then we were talking about doing talking about AI for HVAC. Like, how do you how do you link those two? You know, AI and HVAC. How does that even go? It's almost so easy just to throw AI in your conference calls or your business meetings and strategy and kind of help help get interested in your business. But I think the best way to separate the hype is just focus on the businesses, the core businesses for these manufacturers and distributors and see that they are. Without these different new technologies, they are slower, steadier growing businesses that will grow at like a single digit clip in terms of revenue. And, you know, they could grow a little higher in terms of operating profits and and and EPS as a as a, you know, shave off expenses and kind of manage your businesses prudently. But keep keep in mind the AI and these innovative things could be potentially additive to what they're doing. And, you know, keep that as not a core part of your thesis is kind of how I would think about it. Yeah, yeah, you got you got to level set that because the AI stuff is exciting. But this is not this is not the main thing they do. I mean, data data centers and the industrial part are a big portion of it, but but not fully the business driver. The full business driver still is just the business of keeping the human school. Yeah, and I would say that if AI in that that area didn't even take off and didn't become any part of their business, these companies will still survive and do well. So it's not it's not something that that that they're relying on to to power their business. It might be an area that they're looking for more growth, but it's not an area that's going to keep their businesses steady and growing over a long term clip. Yeah, yeah, that makes sense. Well, we've kind of been teasing that we're going to talk about Ferguson. This one was I was looking at this one is the sort of the one that's maybe hardest for me to understand in terms of the business because they're a distributor, but it's also seems like they've got they're doing supplies as well. It's got a thirty two billion dollar market cap. Nice to little 2% dividend yield feels a little bit to me like one of my building material favorites, which is fast and all, which is a sort of, you know, supplies basically all of the little pieces of buildings. But but Ferguson I think has a more attractive price. So what should we know about Ferguson? Yes, so Ferguson, you know, it's about a thirty two billion dollar market cap. It's the number two HVAC distributor by market share. In addition to heating, ventilation and air conditioning, they do plumbing, which I kind of like the plumbing aspect in there because that adds another key important piece of of the home maintenance and repair and construction business of the of the home. So their customers are contractors, maintenance professionals and a little bit of like do it yourselfers. You know, in 2022, they generated 29 billion in revenue and almost 3 billion in operating profit. And this is one of those companies that, you know, over the past five years, grown sales a little over 6% have about 30% gross profit margins on average and have grown EPS around 17%. Now, I love these companies that are like the slow steady growers that have a nice like mid single digit sales growth with a double digit profit growth. Those are those are the ones that, you know, you're not relying on like high sales growth to drive their business and their earnings. And those are attractive businesses. You know, they sold their European businesses in 2021 and now solely focus on North America. And the other thing I would mention about Watsco, but similar to Ferguson. So Ferguson gets 60% of their business from the repair, maintenance and improvement areas of the business. So when you think of new construction and new housing, you know, that also includes plumbing, heating, HVAC stuff. But then the repair maintenance of all that stuff, that's a bigger portion of their business, which is more recurring. So and same with Watsco. Watsco's business actually is about 85% of sales from repair and replacement parts. So that's attractive because those are more steadier, recurring revenue streams for these businesses. And then 10% are from municipalities, which is a little less tied to the economic cycle. So Ferguson is actually and also reasonably valued. It's trading at about 17 times for 2023 PE, about almost a 7% free cash flow yield. And is projected to grow revenues at about 3% next year and have strong margins. So it's an interesting business. And again, I do like the plumbing aspect in there. It kind of encompasses a little bit more broad exposure. Very interesting name. I've always said that plumbing is the one industry that hasn't been disrupted yet. No one has figured out how to innovate it. And gosh, I wish they would. But the other thing I think that you mentioned there, which is really important, is the repair aspect. Because one of the things I've noticed from the residential real estate side is the age of houses keeps increasing because we aren't building enough housing to keep up with supplies. So we've got aging homes all across America. And it's going to be a bigger and bigger problem that I think we're seeing. So I think that that is another long tail here, too. Yeah, and you know, these things like everyone again, everyone that has houses knows plumbing HVAC systems have cycles. There's there's replacement cycles that they go on. So the longer in a house, the older the house goes, you know, some of the plumbing needs work. Some of the HVAC needs upgrading or improvement. Or maybe you do want to upgrade to some of the newer, more energy efficient technologies that are out there. So you might be looking to doing those. So, yeah, it's it's it's it's not it's it's a business. Businesses are not going to cease to exist. That's for sure. Although I would love to to find out a little bit more about AI and plumbing if I could. That might be my next research research project. Maybe that's the disruption we're looking for or I am plumbing. Yeah, absolutely. You mentioned the municipalities part, too, which makes me wonder if given the sort of like the infrastructure focus with with with the U.S. right now and the money going toward that. Is that also another thing with Ferguson that might really that might really pay off for them long term? Yeah, I think so. You know, it's it's nice to have a good diversity in the business where they're not just tied to to businesses or consumers. They also have a little bit of of something else in there to kind of diversify the revenue and keep them a little bit more resilient. Yeah, yeah, absolutely. So we've talked about a bunch of different companies. It seems like they all do something different. We've got the distributors. We've got the makers. So if you're trying to invest in HVAC, we've seen it's a it's a nice industry, not going to be your like massive grower, but you're going to get some some decent returns here. How would you think about it? Is this is this basket approach? Is this a pick your favorite? What do you think? I think a basket approach is a good approach here because, you know, like we were talking about, there's the manufacturers, the distributors, so they're they're a little different. Their their their businesses are a little different. Their their financials will look a little different. But it's it's it's one of those things where you can find the opportunities when the companies are valued at a reasonable price. Maybe their stocks get hit a little bit and you say, all right, I'm going to pick up a manufacturer and a distributor. And then, you know, these both all these companies are driving their businesses hard, innovating, and there's plenty of opportunity for all of them. As always, people on the program may own stocks mentioned in the Motley Fool may have formal recommendations for or against. So don't buy or sell anything based solely on what you hear. I'm Ricky Mulvey. Thanks for listening. We'll be back tomorrow."}, "podcast_summary": "In this podcast episode, Motley Fool senior analyst Sanmit Deo discusses the HVAC industry with host Deidre Woolard. They explore the growth potential and challenges of companies in the heating, ventilation, and air conditioning sector. \n\nThe HVAC industry in North America is worth around $45 billion and is expected to grow by 4% from 2023 to 2028. The industry is driven by rising disposable incomes, increasing applications in smart homes, and growing demand for heat pumps. Additionally, the US Department of Energy is investing in improving energy efficiency standards.\n\nSome major manufacturers in the HVAC industry include Trane, Lennox, Carrier, and York. The industry also includes distributors that supply these products to contractors and consumers. Watsco and Ferguson are two of the leading HVAC distributors, with Ferguson also involved in the plumbing sector.\n\nThe podcast highlights the importance of the repair, maintenance, and improvement segment of the HVAC industry. As housing stock ages, there is a growing need for HVAC and plumbing upgrades, which provides a stable revenue stream for companies. The industry also faces challenges such as aging infrastructure, a skilled labor shortage, and rising energy costs.\n\nIn terms of investment, a basket approach is recommended, considering both manufacturers and distributors. While the HVAC industry may not be a high-growth sector, it offers steady and reliable returns. Valuations, growth projections, and diversification across different segments of the industry should be considered when investing in HVAC companies.", "podcast_guest": {"name": "Sanmit Deo", "summary": null}, "podcast_highlights": "In the podcast discussion, the following important questions were addressed:\n\n1. What is the state of the air conditioning business and how is it evolving?\n2. What are some of the major drivers and challenges in the HVAC industry?\n3. How is Carrier, a leading HVAC company, shifting its focus and expanding its business?\n4. How is the growth of heat pumps impacting the HVAC industry?\n5. What role does indoor air quality and smart thermostats play in the HVAC industry?\n6. How does the cold chain factor into the HVAC industry and what opportunities does it present?\n7. How do family-run businesses, such as Carrier, navigate and evolve in the industry?\n8. What is the significance of Ferguson, a leading HVAC distributor, and its focus on plumbing and repair?\n9. How can investors approach investing in the HVAC industry and what factors should they consider?\n\nOverall, the discussion highlights the growth potential and challenges in the HVAC industry, as well as the importance of innovation, energy efficiency, and market dynamics in shaping the success of companies in the sector. A basket approach to investing in both manufacturers and distributors in the industry is suggested."}